In [2]:
import pandas as pd
data = pd.read_csv('ratings.csv',sep=',').head()
data

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [9]:
def rat(rating):
    if rating<=2:
        return 'low'
    elif rating<=4 and rating>2:
        return 'middle'
    elif rating==4.5 or rating==5.0:
        return 'high'

In [10]:
data['class']=data['rating'].apply(rat)
data

   userId  movieId  rating   timestamp   class
0       1      296     5.0  1147880044    high
1       1      306     3.5  1147868817  middle
2       1      307     5.0  1147868828    high
3       1      665     5.0  1147878820    high
4       1      899     3.5  1147868510  middle

In [3]:
geodata = pd.read_csv('keywords.csv',sep=',')
geodata.head()

         keyword     shows
0             вк  64292779
1  одноклассники  63810309
2          порно  41747114
3           ютуб  39995567
4      вконтакте  21014195

In [6]:
geo_data = {

'Центр': ['москва', 'тула', 'ярославль'],

'Северо-Запад': ['петербург', 'псков', 'мурманск'],

'Дальний Восток': ['владивосток', 'сахалин', 'хабаровск']
}

In [12]:
elem='москва'
index=geo_data.values()
sum(index,[])

['москва',
 'тула',
 'ярославль',
 'петербург',
 'псков',
 'мурманск',
 'владивосток',
 'сахалин',
 'хабаровск']

In [24]:
def reg(region):
    words=region['keyword'].split()
    for word in words:
        word.lower()
        if word in sum(geo_data.values(),[]):
            for key,value in geo_data.items():
                if word in value:
                    return key
            
        else:
            return 'undefined'

In [26]:
geodata['region']=geodata.apply(reg,axis=1)
geodata.region.value_counts()

undefined         99956
Центр                34
Дальний Восток        5
Северо-Запад          5
Name: region, dtype: int64

In [86]:
movies = pd.read_csv('movies.csv',sep=',')
ratings=pd.read_csv('ratings.csv',sep=',')

In [99]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25000095 entries, 0 to 25000094
Data columns (total 5 columns):
 #   Column     Dtype
---  ------     -----
 0   userId     int64
 1   movieId    int64
 2   rating     float64
 3   timestamp  int64
 4   year       object
dtypes: float64(1), int64(3), object(1)
memory usage: 953.7+ MB

In [77]:
years = range(1950,2011)

In [94]:
movies['year']=movies['title'].apply(production_year)

In [116]:
ratings['year']=movies.apply(connect,axis=1)
ratings.head(3)

   userId  movieId  rating   timestamp  year
0       1      296     5.0  1147880044  None
1       1      306     3.5  1147868817  None
2       1      307     5.0  1147868828  None

In [118]:
ratings.groupby('year').mean().sort_values(by='year',ascending=False)

Empty DataFrame
Columns: [userId, movieId, rating, timestamp]
Index: []

In [93]:
def production_year(string):
    obj=string.split(' ')
    string = obj[-1].replace('(','')
    string = string.replace(')','')
    try:
        if int(string) in years:
            return string
        else:
            return '1900'
    except:
        return '1900'

In [114]:
def connect(row):
    ratings[ratings.movieId==row.movieId]['year']=row.year